NKQC/maimai-input-control-firmware/main_firmware/src/protocol/psoc/psoc_link.cpp
#include "psoc_link.h"
#include "../../config.h"
#include "../../hal/pio/hal_pio.h"
#include <pico/stdlib.h>
#include <hardware/clocks.h>
#include <hardware/gpio.h>
#include <hardware/pio.h>
#include <Arduino.h>
#include <cstring>

// ============================================================
// PIO SPI 主机程序（MODE0 / 8bit / MSB first / 全双工）—— ★延后采样 + DMA 直连版★
// 无 pioasm 集成，故手工汇编内联机器码（编码方式对照本工程已验证的 SWD 程序）。
// side-set 1 bit = SCK(GPIO26)，out pin = MOSI(GPIO28)，in pin = MISO(GPIO27)。
// ★关键1(电气)★：整条 SPI 走同一双向自适应(TXB)电平位移器，往返传播延迟大。若在 SCK 上升沿
// 当拍采样 MISO(零建立时间)，4MHz 起位错位。故采样点延后到 SCK 高相位第 4 拍，给 MISO 经位移器
// 往返留固定延迟补偿 —— 这是已验证能穿过位移器的唯一时序，绝不可改回上升沿当拍采样。
// ★关键2(不堵塞)★：autopull/autopush(阈值 8 bit) 使 DMA 能以 8 位传输直接对接内存字节流：
// CPU 不再逐字节 put/get，收发退化为纯内存操作(见 _transfer())。FIFO 空/满时 SM 自然停在
// out(side 0，SCK 保持低)，无需软件干预。
// ------------------------------------------------------------
//  0: out pins,1 [2]    side 0   (wrap target) 驱动 MOSI(OSR 高位在前=MSB)；SCK 低 3 拍(含下降沿)
//  1: nop        [3]    side 1   SCK 升高，等 4 拍让 MISO 经位移器往返稳定
//  2: in  pins,1        side 1   SCK 仍高，延后采样 MISO(升高后第 4 拍)；autopush 满 8 bit 自动推出
//     → wrap 回 0（SCK 回低，下一 bit）
// 每 bit 8 拍：SCK 高 5 拍、低 3 拍，采样点=上升后第 4 拍。★程序与采样点一个字都没动★，
// 变的只有单次 DMA 的传输长度(v1 的 7B/帧 → v2 的 K×16B 整批)——这是唯一验证过能穿过位移器的时序。
// ============================================================
static const uint16_t psoc_link_program_instructions[] = {
    0x6201, // 0: out pins,1   side 0 [2]   驱动 MOSI，SCK 低 3 拍（autopull 自动取字节）
    0xB342, // 1: nop          side 1 [3]   SCK 高，等 4 拍让 MISO 稳定
    0x5001, // 2: in  pins,1   side 1       延后采样 MISO（升高后第 4 拍，autopush 自动推出）
};

static const struct pio_program psoc_link_program = {
    .instructions = psoc_link_program_instructions,
    .length = 3,
    .origin = -1,
};

namespace {
constexpr uint8_t PROG_WRAP_TARGET = 0;
constexpr uint8_t PROG_WRAP = 2;
constexpr float CYCLES_PER_BIT = 8.0f;  // out3(低相位) + nop4 + in1 = 8；采样点=升高后第 4 拍
constexpr uint8_t SHIFT_BITS = 8;       // autopull/autopush 阈值：一次一字节，配 8 位 DMA
// CS guard time for the TXB level shifter.
constexpr uint32_t CS_SETUP_US = 2;
constexpr uint32_t CS_HOLD_US = 2;
// DMA timeout backstop; one burst is LNK_BURST_MAX x LNK_FRAME_SIZE bytes (8x16B @2MHz ~= 512us).
constexpr uint32_t XFER_TIMEOUT_US = 4000;
constexpr uint16_t PAGE_NONE = 0xFFFFu;   // 页槽空闲哨兵(0 是合法页号)
}  // namespace

PsocLink::PsocLink(uint8_t sck_pin, uint8_t mosi_pin, uint8_t miso_pin, uint8_t cs_pin)
    : _sck_pin(sck_pin), _mosi_pin(mosi_pin), _miso_pin(miso_pin), _cs_pin(cs_pin),
      _pio(nullptr), _sm(0), _offset(0), _ready(false) {
    for (uint32_t i = 0; i < LNK_TXN_SLOTS; ++i) _txn[i].clear();
    _snap.clear();
    _algo.clear();
}

bool PsocLink::init() {
    _pio = HAL_PIO1::getInstance();
    if (!_pio->init(_sck_pin)) {
        return false;
    }
    // 三根信号线都交给 PIO1（init 可能因已初始化而短路）
    _pio->init_pin(_sck_pin);
    _pio->init_pin(_mosi_pin);
    _pio->init_pin(_miso_pin);

    // CS 普通 GPIO 输出，空闲高（未选中）
    gpio_init(_cs_pin);
    gpio_set_dir(_cs_pin, true);
    gpio_put(_cs_pin, 1);

    // INT2 经自适应电平位移器中继；内部上下拉会破坏它的空余电平，保持高阻输入。
    gpio_init(PIN_SENSOR_INT2);
    gpio_set_dir(PIN_SENSOR_INT2, GPIO_IN);
    gpio_disable_pulls(PIN_SENSOR_INT2);

    if (!_pio->load_program(&psoc_link_program, &_offset)) {
        return false;
    }
    if (!_pio->claim_sm(&_sm)) {
        _pio->unload_program(&psoc_link_program, _offset);
        return false;
    }

    // 方向：SCK / MOSI 输出；MISO 保持输入（默认，勿设为输出）
    _pio->sm_set_pindirs_out(_sm, _sck_pin, 1);
    _pio->sm_set_pindirs_out(_sm, _mosi_pin, 1);

    PIOStateMachineConfig cfg;
    cfg.out_base = _mosi_pin; cfg.out_count = 1;
    cfg.in_base = _miso_pin;
    cfg.sideset_base = _sck_pin;
    cfg.sideset_bit_count = 1;
    cfg.sideset_optional = false;
    cfg.sideset_pindirs = false;
    // ★MSB first + 8 bit 自动移位★：DMA 以 8 位窄写把字节送进 TX FIFO，RP2040 窄写会把该字节
    // 复制到全部 4 个字节道，故左移的 OSR 取高位仍得到该字节；收侧左移满 8 bit 后字节落 ISR[7:0]，
    // DMA 从 RX FIFO 的第 0 字节道读出即可。阈值 8 = 一次一字节，与 DMA 的字节流严格 1:1。
    cfg.out_shift_right = false; cfg.autopull = true; cfg.pull_threshold = SHIFT_BITS;
    cfg.in_shift_right = false;  cfg.autopush = true; cfg.push_threshold = SHIFT_BITS;
    cfg.wrap_target = _offset + PROG_WRAP_TARGET;
    cfg.wrap = _offset + PROG_WRAP;
    cfg.program_offset = _offset;
    cfg.clkdiv = (float)clock_get_hz(clk_sys) / ((float)PSOC_SPI_SCK_HZ * CYCLES_PER_BIT);
    cfg.enabled = true;   // 首指令为 out(autopull)，TX FIFO 空则停在此处，SCK 保持低位

    if (!_pio->sm_configure(_sm, cfg)) {
        return false;
    }

    // 收发各一条 DMA 通道，由本 SM 的 TX/RX DREQ 节流；此后 CPU 不再触碰任何单个字节。
    DmaDuplexPorts ports;
    ports.tx_fifo = _pio->sm_fifo_byte_addr(_sm, true);
    ports.rx_fifo = _pio->sm_fifo_byte_addr(_sm, false);
    ports.tx_dreq = _pio->sm_dreq(_sm, true);
    ports.rx_dreq = _pio->sm_dreq(_sm, false);
    if (!_dma.init(ports)) {
        return false;
    }

    _ready = true;
    return true;
}

// 事务异常(DMA 完成标志未在上限内置起)后恢复主机 PIO，使下一笔硬件传输仍可启动。
// 它只处理本机硬件故障；帧边界始终由跨事务的字节流解析器判定，绝不靠这里重对齐。
void PsocLink::_recover() {
    _pio->sm_set_enabled(_sm, false);
    _pio->sm_clear_fifos(_sm);
    _pio->sm_restart(_sm);                                   // 清 ISR/OSR/移位计数/延时
    _pio->sm_exec(_sm, (uint16_t)(0x0000u | _offset));       // jmp <program start>
    _pio->sm_set_enabled(_sm, true);
}

// ★唯一线级原语★ 一次 CS 圈住整批 K 个整帧(len = K*LNK_FRAME_SIZE), 中间不拆、不等待, 一条 DMA 走完。
// I1 要求正常事务不得清 FIFO 或重置 PIO 状态；CS 仅划分事务，响应帧边界由 I2 内容解析确定。
bool PsocLink::_transfer(const uint8_t* tx, uint8_t* rx, size_t len) {
    if (rx != nullptr) std::memset(rx, 0, len);
    if (!_ready || len == 0) return false;

    gpio_put(_cs_pin, 0);
    busy_wait_us_32(CS_SETUP_US);
    _dma.start(tx, rx, len);
    const bool done = _dma.wait(XFER_TIMEOUT_US);
    busy_wait_us_32(CS_HOLD_US);
    gpio_put(_cs_pin, 1);
    if (!done) _recover();
    return done;
}

// ---------------------------------------------------------------- 事务表 ----
int PsocLink::_slot_of(uint8_t tag) const {
    if (tag == LNK_TAG_NONE) return -1;
    for (uint32_t i = 0; i < LNK_TXN_SLOTS; ++i) {
        if (_txn[i].tag == tag && _txn[i].state != (uint8_t)TxnState::FREE) return (int)i;
    }
    return -1;
}

