NKQC/maimai-input-control-firmware/main_firmware/src/protocol/psoc/psoc_link.cpp
int PsocLink::_free_slot() const {
    for (uint32_t i = 0; i < LNK_TXN_SLOTS; ++i) {
        if (_txn[i].state == (uint8_t)TxnState::FREE) return (int)i;
    }
    return -1;
}

uint32_t PsocLink::_free_count() const {
    uint32_t n = 0u;
    for (uint32_t i = 0; i < LNK_TXN_SLOTS; ++i) {
        if (_txn[i].state == (uint8_t)TxnState::FREE) n++;
    }
    return n;
}

uint32_t PsocLink::_inflight_count() const {
    uint32_t n = 0u;
    for (uint32_t i = 0; i < LNK_TXN_SLOTS; ++i) {
        if (_txn[i].state == (uint8_t)TxnState::INFLIGHT) n++;
    }
    return n;
}

int PsocLink::_next_queued() const {
    for (uint32_t i = 0; i < LNK_TXN_SLOTS; ++i) {
        if (_txn[i].state == (uint8_t)TxnState::QUEUED) return (int)i;
    }
    return -1;
}

// 单调循环分配 1..LNK_TAG_MAX, 跳过仍被占用的值。循环长度(127)远大于从机去重缓存深度(8),
// 故一个 tag 被复用时它的旧响应必然早已被挤出缓存 —— 不会被误判成重复请求。
uint8_t PsocLink::_alloc_tag() {
    for (uint32_t n = 0; n < LNK_TAG_MAX; ++n) {
        const uint8_t tag = _next_tag;
        _next_tag = (uint8_t)((_next_tag >= LNK_TAG_MAX) ? LNK_TAG_MIN : (_next_tag + 1u));
        if (_slot_of(tag) < 0) return tag;
    }
    return LNK_TAG_NONE;
}

uint8_t PsocLink::_submit_slot(uint8_t cmd, const uint8_t args[LNK_ARG_BYTES], bool internal) {
    const int slot = _free_slot();
    if (slot < 0) return LNK_TAG_NONE;
    const uint8_t tag = _alloc_tag();
    if (tag == LNK_TAG_NONE) return LNK_TAG_NONE;
    Txn& t = _txn[slot];
    t.clear();
    t.state = (uint8_t)TxnState::QUEUED;
    t.tag = tag;
    t.cmd = cmd;
    t.internal = internal ? 1u : 0u;
    if (args != nullptr) {
        for (uint32_t i = 0; i < LNK_ARG_BYTES; ++i) t.args[i] = args[i];
    }
    return tag;
}

uint8_t PsocLink::submit(uint8_t cmd, const uint8_t args[LNK_ARG_BYTES]) {
    if (!_ready) return LNK_TAG_NONE;
    // 永远给链路自己留一格: 表被业务占满时连掩码刷新事务都投不进去, 触控会假性冻结。
    if (_free_count() <= 1u) return LNK_TAG_NONE;
    return _submit_slot(cmd, args, false);
}

PsocLink::TxnState PsocLink::txn_state(uint8_t tag) const {
    const int slot = _slot_of(tag);
    if (slot < 0) return TxnState::FREE;
    return (TxnState)_txn[slot].state;
}

bool PsocLink::take(uint8_t tag, uint8_t payload[LNK_PAYLOAD_BYTES]) {
    const int slot = _slot_of(tag);
    if (slot < 0) return false;
    Txn& t = _txn[slot];
    if (t.state != (uint8_t)TxnState::DONE) return false;
    if (payload != nullptr) {
        for (uint32_t i = 0; i < LNK_PAYLOAD_BYTES; ++i) payload[i] = t.payload[i];
    }
    t.clear();
    return true;
}

void PsocLink::abandon(uint8_t tag) {
    const int slot = _slot_of(tag);
    if (slot < 0) return;
    // ★放弃只影响本事务★ 从机若还会把它的响应吐上来, 会因 tag 已退役而被丢弃, 不污染任何人。
    _txn[slot].clear();
}

// 在 I3 下 RX 环溢出与帧丢失结构上不会发生；此分支只保留给硬件异常，正常运行应恒不触发。
// 因而 _txn_retry_count 是链路已经出现异常的诊断指示，而非吞吐调节手段。
void PsocLink::_retire_timeouts() {
    const uint32_t now = time_us_32();
    for (uint32_t i = 0; i < LNK_TXN_SLOTS; ++i) {
        Txn& t = _txn[i];
        if (t.state != (uint8_t)TxnState::INFLIGHT) continue;
        if ((uint32_t)(now - t.sent_us) < RETRY_US) continue;
        // ★停摆期间不扣重试预算★ 本条发出之后一帧合法帧都没见过 ⇒ 从机整段没在应答(CapSense
        // 临界区压住了它的 DMA 完成中断), 这不是"我的请求丢了", 而是"谁的响应都出不来"。
        // 此时扣预算等于用别人的故障判自己死刑 —— 满容量上传就是这么被误判失败的。
        // 只重排队、刷新计时, 预算留给"从机明明在应答却偏偏不答我"这种真正可疑的情形。
        const bool slave_answered_since = (int32_t)(_last_frame_us - t.sent_us) > 0;
        t.sent_us = now;
        if (!slave_answered_since) {
            t.state = (uint8_t)TxnState::QUEUED;
            continue;
        }
        t.tries++;
        if (_txn_retry_count < 0xFFFFu) _txn_retry_count++;
        if (t.tries > MAX_TRIES) {
            t.state = (uint8_t)TxnState::FAILED;
            // 内部掩码刷新事务无人认领, 就地回收, 否则会永久占着刷新槽。
            if (t.internal != 0u) {
                if (t.tag == _status_txn_tag) _status_txn_tag = LNK_TAG_NONE;
                t.clear();
            }
        } else {
            t.state = (uint8_t)TxnState::QUEUED;
        }
    }
}

void PsocLink::_publish_status_frame(const uint8_t* body) {
    uint64_t mask = 0u;
    for (uint32_t i = 0; i < 5u; ++i) mask |= (uint64_t)body[i] << (8u * i);
    _touch_mask = mask & (((uint64_t)1u << LNK_CHANNEL_COUNT) - 1u);
    _generation = lnk_rd16(&body[5]);
    _last_status_us = time_us_32();
}

bool PsocLink::frame_fresh(uint32_t within_us) const {
    if (_last_frame_us == 0u) return false;
    return (uint32_t)(time_us_32() - _last_frame_us) <= within_us;
}

bool PsocLink::status_fresh(uint32_t within_us) const {
    if (_last_status_us == 0u) return false;
    return (uint32_t)(time_us_32() - _last_status_us) <= within_us;
}

bool PsocLink::tx_window_blocked() const {
    return !gpio_get(PIN_SENSOR_INT2);
}

// ★掩码刷新必须自己拿事务保证★ 掩码只出现在 tag=0 的主动状态帧里, 而从机一旦有排队响应就先
// 吐响应 —— 算法上传/快照这类密集流期间可能长时间见不到状态帧。到期就投一条内部 STATUS 事务,
// 它的响应带 tag、内容与状态帧完全相同, 于是触控在任何流量形态下都持续更新。
void PsocLink::_refresh_mask_if_due() {
    if (_status_txn_tag != LNK_TAG_NONE) return;
    if ((uint32_t)(time_us_32() - _last_status_us) < MASK_MAX_STALE_US) return;
    if (_free_slot() < 0) return;
    _status_txn_tag = _submit_slot(LNK_CMD_STATUS, nullptr, true);
}

// 收帧: 校验 → 无条件发布 st → 按 tag 认领。三类异常(非法帧 / 已退役 tag / 主动状态帧)各自处理,
// **任何情况都不改动其它事务的状态** ⇒ 不存在"失步"这种状态。
bool PsocLink::_accept(const uint8_t* rx) {
    if (!lnk_frame_ok(rx, LNK_SOF_RSP)) {
        if (_rx_reject_count < 0xFFFFu) _rx_reject_count++;
        return false;
    }
    _status = rx[LNK_OFF_ST];
    _last_frame_us = time_us_32();

    const uint8_t tag = rx[LNK_OFF_TAG];
    if (tag == LNK_TAG_NONE) {
        _publish_status_frame(&rx[LNK_OFF_BODY]);
        return true;
    }
    const int slot = _slot_of(tag);
    if (slot < 0) {
        // 迟到/重复响应: tag 早已退役。丢弃即可, 陈旧数据无法冒充任何一轮的结果。
        if (_stale_tag_count < 0xFFFFu) _stale_tag_count++;
        return true;
    }
    Txn& t = _txn[slot];
    if (t.state == (uint8_t)TxnState::INFLIGHT || t.state == (uint8_t)TxnState::QUEUED) {
        for (uint32_t i = 0; i < LNK_PAYLOAD_BYTES; ++i) t.payload[i] = rx[LNK_OFF_BODY + i];
        t.state = (uint8_t)TxnState::DONE;
        if (t.internal != 0u) {
            _publish_status_frame(t.payload);
            if (t.tag == _status_txn_tag) _status_txn_tag = LNK_TAG_NONE;
            t.clear();
        }
    }
    return true;
}

// ★一次 CS、一条 DMA、K 个整帧, 事后按 tag 异步对账★
// I2 不把 CS 当作响应帧边界；I3 在本批开始时按带外 INT2 电平一次性准入整批。
uint32_t PsocLink::pump(uint32_t max_frames) {
    if (!_ready) return 0u;
    // I3 reserves LNK_BURST_MAX slots above the threshold, so sample INT2 once: a high permits this
    // complete burst even if the PSoC lowers the level while it drains. Rechecking per frame would only
    // split a safe burst and waste CS setup/hold overhead.
    if (tx_window_blocked()) return 0u;
    if (max_frames == 0u) max_frames = 1u;
    if (max_frames > LNK_BURST_MAX) max_frames = LNK_BURST_MAX;

    _retire_timeouts();
    _refresh_mask_if_due();

