NKQC/maimai-input-control-firmware/main_firmware/src/protocol/psoc/psoc_link.cpp
    uint8_t txbuf[LNK_BURST_MAX * LNK_FRAME_SIZE];
    uint8_t rxbuf[LNK_BURST_MAX * LNK_FRAME_SIZE];
    int8_t batch_slot[LNK_BURST_MAX];
    const uint32_t now = time_us_32();
    uint32_t frames = 0u;

    for (; frames < max_frames; ++frames) {
        const int slot = _next_queued();
        if (slot < 0) {
            const bool drain = _inflight_count() != 0u;
            const bool watchdog = (uint32_t)(now - _last_frame_us) >= LINK_WATCHDOG_US;
            if (!drain && !_probe_pending && !watchdog) break;
            _probe_pending = false;
        }

        uint8_t* tx = &txbuf[frames * LNK_FRAME_SIZE];
        std::memset(tx, 0, LNK_FRAME_SIZE);
        tx[LNK_OFF_SOF] = LNK_SOF_REQ;
        if (slot >= 0) {
            Txn& t = _txn[slot];
            tx[LNK_OFF_TAG] = t.tag;
            tx[LNK_OFF_CMD] = t.cmd;
            for (uint32_t i = 0; i < LNK_ARG_BYTES; ++i) tx[LNK_OFF_BODY + i] = t.args[i];
            t.state = (uint8_t)TxnState::INFLIGHT;
            t.sent_us = now;
        } else {
            tx[LNK_OFF_TAG] = LNK_TAG_NONE;
            tx[LNK_OFF_CMD] = LNK_CMD_STATUS;
        }
        lnk_seal(tx);
        batch_slot[frames] = (int8_t)slot;

        if (slot < 0 && _inflight_count() == 0u) {
            frames++;
            break;
        }
    }

    if (frames == 0u) return 0u;

    if (!_transfer(txbuf, rxbuf, (size_t)frames * LNK_FRAME_SIZE)) {
        // 硬件传输失败后仅重排事务；本批未完成的事务会在后续带外电平允许的批次中安全重投。
        for (uint32_t i = 0; i < frames; ++i) {
            const int slot = batch_slot[i];
            if (slot >= 0 && _txn[slot].state == (uint8_t)TxnState::INFLIGHT) {
                _txn[slot].state = (uint8_t)TxnState::QUEUED;
            }
        }
        return 0u;
    }

    uint8_t stream[(LNK_FRAME_SIZE - 1u) + LNK_BURST_MAX * LNK_FRAME_SIZE];
    const size_t rx_len = (size_t)frames * LNK_FRAME_SIZE;
    std::memcpy(stream, _carry, _carry_len);
    std::memcpy(&stream[_carry_len], rxbuf, rx_len);
    const size_t stream_len = (size_t)_carry_len + rx_len;
    size_t offset = 0u;
    uint32_t received = 0u;
    while ((stream_len - offset) >= LNK_FRAME_SIZE) {
        const uint8_t* frame = &stream[offset];
        if (lnk_frame_ok(frame, LNK_SOF_RSP)) {
            if (_accept(frame)) received++;
            offset += LNK_FRAME_SIZE;
        } else {
            offset++;
        }
    }
    _carry_len = (uint8_t)(stream_len - offset);
    if (_carry_len != 0u) std::memcpy(_carry, &stream[offset], _carry_len);
    return received;
}

bool PsocLink::request(uint8_t cmd, const uint8_t args[LNK_ARG_BYTES],
                       uint8_t payload[LNK_PAYLOAD_BYTES], uint32_t timeout_us) {
    if (!_ready) return false;
    const uint8_t tag = submit(cmd, args);
    if (tag == LNK_TAG_NONE) return false;
    const uint32_t start = time_us_32();
    for (;;) {
        pump(4u);
        const TxnState st = txn_state(tag);
        if (st == TxnState::DONE) return take(tag, payload);
        if (st == TxnState::FAILED || st == TxnState::FREE) {
            abandon(tag);
            return false;
        }
        if ((uint32_t)(time_us_32() - start) > timeout_us) {
            abandon(tag);
            return false;
        }
    }
}

bool PsocLink::ping(uint32_t* out_fw, uint8_t* out_abi) {
    uint8_t p[LNK_PAYLOAD_BYTES] = {0};
    if (!request(LNK_CMD_PING, nullptr, p)) return false;
    if (out_fw) *out_fw = lnk_rd32(p);
    if (out_abi) *out_abi = p[4];
    // 帧长/ABI 不一致就不建链 —— 带着错帧长跑比明确失败坏得多。
    return p[4] == LNK_ABI_VERSION && p[5] == LNK_FRAME_SIZE;
}

bool PsocLink::indicator_on() {
    return request(LNK_CMD_INDICATOR_ON, nullptr, nullptr);
}

// ---------------------------------------------------------------- 快照 ----
void PsocLink::_snap_reset() {
    for (uint32_t ch = 0; ch < LNK_CHANNEL_COUNT; ++ch) {
        if (_snap.tag[ch] != LNK_TAG_NONE) abandon(_snap.tag[ch]);
    }
    if (_snap.latch_tag != LNK_TAG_NONE) abandon(_snap.latch_tag);
    _snap.clear();
}

void PsocLink::_snap_publish(psoc::SensorSnapshot* out) const {
    if (out == nullptr) return;
    out->clear();
    out->generation = _snap.generation;
    out->valid = _snap.valid != 0u;
    for (uint32_t ch = 0; ch < LNK_CHANNEL_COUNT; ++ch) out->channels[ch] = _snap.sample[ch];
}

// 分块全通道快照。★不再有"一个分块必须在同一次调用内连续完成"这条约束★: 通道事务各带 tag,
// 乱序收齐即可, 中途插入触控轮询/命令流都不会吞掉任何一份应答。
bool PsocLink::snapshot_pump(uint8_t max_frames, psoc::SensorSnapshot* out) {
    if (!_ready) return false;
    const uint32_t now = time_us_32();
    // 陈旧的半份快照不许永久霸占: 超期即丢弃进度, 下次从新锁存的代数重来。
    if (_snap.phase != 0u && (uint32_t)(now - _snap.start_us) > SNAP_COMPLETE_TIMEOUT_US) {
        _snap_reset();
    }
    if (_snap.phase == 0u) {
        const uint8_t tag = submit(LNK_CMD_SNAP_LATCH, nullptr);
        if (tag == LNK_TAG_NONE) { (void)pump(max_frames); return false; }
        _snap.clear();
        _snap.latch_tag = tag;
        _snap.phase = 1u;
        _snap.start_us = now;
        _snap.pending = ((uint64_t)1u << LNK_CHANNEL_COUNT) - 1u;
    }

    (void)pump(max_frames);
    uint8_t p[LNK_PAYLOAD_BYTES] = {0};

    if (_snap.phase == 1u) {
        // SNAP_LATCH 是★延迟应答★: 从机完成 252B 锁存后才回。拿到它即保证随后任意顺序的
        // SNAP_CH 都属于同一代 —— v1 那套"BEGIN 与 INFO 必须相邻 + 主循环锁存窗"随之退役。
        const TxnState st = txn_state(_snap.latch_tag);
        if (st == TxnState::DONE) {
            (void)take(_snap.latch_tag, p);
            _snap.latch_tag = LNK_TAG_NONE;
            _snap.generation = lnk_rd16(p);
            _snap.valid = (p[2] != 0u) ? 1u : 0u;
            if (_snap.valid == 0u || p[3] != LNK_CHANNEL_COUNT) {
                // 从机尚未发布过代数: 如实上报无效代数, 不为它白搬 36 帧。
                if (out != nullptr) {
                    out->clear();
                    out->generation = _snap.generation;
                    out->valid = false;
                }
                _snap_reset();
                return true;
            }
            _snap.phase = 2u;
        } else if (st == TxnState::FAILED || st == TxnState::FREE) {
            _snap_reset();
            return false;
        } else {
            return false;
        }
    }

    // 收割已完成的通道事务
    uint8_t inflight = 0u;
    for (uint32_t ch = 0; ch < LNK_CHANNEL_COUNT; ++ch) {
        if (_snap.tag[ch] == LNK_TAG_NONE) continue;
        const TxnState st = txn_state(_snap.tag[ch]);
        if (st == TxnState::DONE) {
            (void)take(_snap.tag[ch], p);
            _snap.tag[ch] = LNK_TAG_NONE;
            if (p[0] != (uint8_t)ch) continue;   // 通道自述不符: 该通道留在 pending, 重投一次
            psoc::SensorSample& s = _snap.sample[ch];
            s.raw = lnk_rd16(&p[1]);
            s.baseline = lnk_rd16(&p[3]);
            s.diff = (int16_t)lnk_rd16(&p[5]);
            s.status = p[7];
            _snap.pending &= ~((uint64_t)1u << ch);
        } else if (st == TxnState::FAILED || st == TxnState::FREE) {
            abandon(_snap.tag[ch]);
            _snap.tag[ch] = LNK_TAG_NONE;
        } else {
            inflight++;
        }
    }
    // 补投: 只保持 SNAP_MAX_INFLIGHT 条在途, 给轮询帧与其它命令留出事务表余量。
    for (uint32_t ch = 0; ch < LNK_CHANNEL_COUNT && inflight < SNAP_MAX_INFLIGHT; ++ch) {
        if (((_snap.pending >> ch) & 1u) == 0u || _snap.tag[ch] != LNK_TAG_NONE) continue;
        uint8_t args[LNK_ARG_BYTES] = {0};
        args[0] = (uint8_t)ch;
        const uint8_t tag = submit(LNK_CMD_SNAP_CH, args);
        if (tag == LNK_TAG_NONE) break;
        _snap.tag[ch] = tag;
        inflight++;
    }
    if (_snap.pending != 0u) return false;

    _snap_publish(out);
    _snap_reset();
    return true;
}

// 单通道快路(独占精调): 一次调用取一份完整样本, 仅回填该通道, 其余通道保持调用方原值。
bool PsocLink::snapshot_pump_channel(uint8_t ch, psoc::SensorSnapshot* out) {
    if (!_ready || out == nullptr || ch >= LNK_CHANNEL_COUNT) return false;
    uint8_t p[LNK_PAYLOAD_BYTES] = {0};
    if (!request(LNK_CMD_SNAP_LATCH, nullptr, p)) return false;
    out->generation = lnk_rd16(p);
    out->valid = p[2] != 0u;
    if (!out->valid) return true;

    uint8_t args[LNK_ARG_BYTES] = {0};
    args[0] = ch;
    if (!request(LNK_CMD_SNAP_CH, args, p)) return false;
    if (p[0] != ch) return false;
    psoc::SensorSample& s = out->channels[ch];
    s.raw = lnk_rd16(&p[1]);
    s.baseline = lnk_rd16(&p[3]);
    s.diff = (int16_t)lnk_rd16(&p[5]);
    s.status = p[7];
    return true;
}

// ------------------------------------------------------------ 算法下发 ----
void PsocLink::_algo_note_abort(AlgoAbort reason, uint16_t page) {
    _algo_abort_reason = (uint8_t)reason;
    _algo_abort_page = page;
    if (_algo_abort_count < 0xFFFFu) _algo_abort_count++;
}

