NKQC/maimai-input-control-firmware/main_firmware/src/protocol/psoc/psoc_link.cpp
void PsocLink::_algo_fail(AlgoAbort reason, uint16_t page, bool* out_complete) {
    _algo_note_abort(reason, page);
    for (uint32_t i = 0; i < ALGO_MAX_INFLIGHT; ++i) {
        if (_algo.page_tag[i] != LNK_TAG_NONE) abandon(_algo.page_tag[i]);
    }
    if (_algo.ctl_tag != LNK_TAG_NONE) abandon(_algo.ctl_tag);
    _algo.clear();
    if (out_complete) *out_complete = true;
}

bool PsocLink::_algo_submit_page(uint32_t idx) {
    const uint16_t page = _algo.page_no[idx];
    uint8_t args[LNK_ARG_BYTES] = {0};
    lnk_wr16(args, page);
    const uint32_t base = (uint32_t)page * LNK_ALGO_PAGE_BYTES;
    for (uint32_t b = 0; b < LNK_ALGO_PAGE_BYTES; ++b) {
        const uint32_t off = base + b;
        // 不足一页的末页补 0；从机的 CRC16 只覆盖 [0,len)，补齐内容不参与校验。
        args[2u + b] = (off < _algo.len) ? _algo.data[off] : 0u;
    }
    const uint8_t tag = submit(LNK_CMD_ALGO_PAGE, args);
    if (tag == LNK_TAG_NONE) return false;
    _algo.page_tag[idx] = tag;
    return true;
}

// 收割已完成的页事务并补投新页。★单页失败只补发该页★(绝对寻址 offset = page*LNK_ALGO_PAGE_BYTES),
// v1 那套"逐页交替重试 + 整轮从 BEGIN 重传"在 v2 里没有存在理由。
// ★重投预算是逐页的★ 判据 = 同一页连续失败 ALGO_PAGE_MAX_TRIES 次(绝对寻址下同一页重投结果完全
// 相同, 只有连续失败才说明是真故障)。整轮累计上限已删除: 它把"链路偶尔重投一次"与"某页真的写不
// 进去"混成一件事, 几百页的上传平均每十几页重投一次就撞满总预算, 于是随机某页被判永久失败。
bool PsocLink::_algo_pump_pages(uint16_t* out_fail_page) {
    uint8_t p[LNK_PAYLOAD_BYTES] = {0};
    for (uint32_t i = 0; i < ALGO_MAX_INFLIGHT; ++i) {
        if (_algo.page_tag[i] == LNK_TAG_NONE) continue;
        const TxnState st = txn_state(_algo.page_tag[i]);
        bool page_retry = false;
        if (st == TxnState::DONE) {
            (void)take(_algo.page_tag[i], p);
            _algo.page_tag[i] = LNK_TAG_NONE;
            // 页号回显不符 = 从机拒收(越界 / 无在途上传)。留在本槽等重投。
            if (lnk_rd16(p) == _algo.page_no[i]) _algo.page_no[i] = PAGE_NONE;
            else page_retry = true;
        } else if (st == TxnState::FAILED || st == TxnState::FREE) {
            abandon(_algo.page_tag[i]);
            _algo.page_tag[i] = LNK_TAG_NONE;
            page_retry = true;
        }
        if (!page_retry) continue;
        if (_algo.retries < 0xFFFFu) _algo.retries++;   // 仅诊断计数, 不是失败判据
        if (++_algo.page_try[i] >= ALGO_PAGE_MAX_TRIES) {
            if (out_fail_page) *out_fail_page = _algo.page_no[i];
            return false;
        }
    }
    // 补投: 先补重投页, 再取新页, 保持至多 ALGO_MAX_INFLIGHT 条在途。
    for (uint32_t i = 0; i < ALGO_MAX_INFLIGHT; ++i) {
        if (_algo.page_tag[i] != LNK_TAG_NONE) continue;
        if (_algo.page_no[i] == PAGE_NONE) {
            if (_algo.next_page >= _algo.pages) continue;
            _algo.page_no[i] = _algo.next_page++;
            _algo.page_try[i] = 0u;   // 新页领入本槽: 该页的重投预算从头计
        }
        if (!_algo_submit_page(i)) break;   // 事务表暂时满: 下一拍再投
    }
    return true;
}

bool PsocLink::begin_upload_algo(const uint8_t* data, uint16_t len, uint16_t crc16) {
    if (!_ready || data == nullptr || len == 0u || len > LNK_ALGO_SLOT_SIZE) return false;
    if (_algo.phase != 0u) {
        // 上一轮的状态没归零就又来一次 ⇒ 状态泄漏。★必须留痕★: 否则此后每次上传都被静默拒掉,
        // 主机只看到"永远传不上去"。
        _algo_note_abort(AlgoAbort::BEGIN_BUSY, 0xFFFFu);
        return false;
    }
    uint8_t args[LNK_ARG_BYTES] = {0};
    lnk_wr16(args, len);
    const uint8_t tag = submit(LNK_CMD_ALGO_BEGIN, args);
    if (tag == LNK_TAG_NONE) {
        _algo_note_abort(AlgoAbort::BEGIN_REJECTED, 0xFFFFu);
        return false;
    }
    _algo.clear();
    _algo.data = data;
    _algo.len = len;
    _algo.crc16 = crc16;
    _algo.pages = (uint16_t)((len + LNK_ALGO_PAGE_BYTES - 1u) / LNK_ALGO_PAGE_BYTES);
    _algo.phase = 1u;
    _algo.ctl_tag = tag;
    _algo.started_ms = millis();
    _algo.last_info_ms = _algo.started_ms;
    return true;
}

bool PsocLink::poll_upload_algo(bool* out_complete, bool* out_ok, bool* out_valid, uint16_t* out_len) {
    if (out_complete) *out_complete = false;
    if (out_ok) *out_ok = false;
    if (out_valid) *out_valid = false;
    if (out_len) *out_len = 0u;
    if (_algo.phase == 0u) return true;

    // 页阶段一次推多帧(在途并发), commit 阶段只需推进那一条 INFO 事务。
    (void)pump(ALGO_MAX_INFLIGHT + 2u);
    const uint32_t now_ms = millis();
    if ((uint32_t)(now_ms - _algo.started_ms) >= ALGO_UPLOAD_TIMEOUT_MS) {
        const bool committing = _algo.phase >= 3u;
        _algo_fail(committing ? AlgoAbort::COMMIT_TIMEOUT : AlgoAbort::PAGE_REJECTED,
                   _algo.next_page, out_complete);
        return false;
    }
    uint8_t p[LNK_PAYLOAD_BYTES] = {0};

    if (_algo.phase == 1u) {
        const TxnState st = txn_state(_algo.ctl_tag);
        if (st == TxnState::DONE) {
            (void)take(_algo.ctl_tag, p);
            _algo.ctl_tag = LNK_TAG_NONE;
            // BEGIN 未被受理时它很可能**已经**清空了从机的暂存长度, 现象与 CRC 失败一模一样,
            // 故这条出口必须单独留痕(见 AlgoAbort 注释)。
            if (lnk_rd16(p) != _algo.len) {
                _algo_fail(AlgoAbort::BEGIN_REJECTED, 0xFFFFu, out_complete);
                return false;
            }
            _algo.phase = 2u;
        } else if (st == TxnState::FAILED || st == TxnState::FREE) {
            _algo_fail(AlgoAbort::BEGIN_REJECTED, 0xFFFFu, out_complete);
            return false;
        }
        return true;
    }

    if (_algo.phase == 2u) {
        uint16_t fail_page = 0u;
        if (!_algo_pump_pages(&fail_page)) {
            _algo_fail(AlgoAbort::PAGE_REJECTED, fail_page, out_complete);
            return false;
        }
        if (_algo.next_page < _algo.pages) return true;
        for (uint32_t i = 0; i < ALGO_MAX_INFLIGHT; ++i) {
            if (_algo.page_tag[i] != LNK_TAG_NONE || _algo.page_no[i] != PAGE_NONE) return true;
        }
        uint8_t args[LNK_ARG_BYTES] = {0};
        lnk_wr16(args, _algo.crc16);
        const uint8_t tag = submit(LNK_CMD_ALGO_END, args);
        if (tag == LNK_TAG_NONE) return true;   // 表暂时满, 下一拍再发
        _algo.ctl_tag = tag;
        _algo.phase = 3u;
        return true;
    }

    if (_algo.phase == 3u) {
        const TxnState st = txn_state(_algo.ctl_tag);
        if (st == TxnState::DONE) {
            (void)take(_algo.ctl_tag, p);
            _algo.ctl_tag = LNK_TAG_NONE;
            if (p[0] == 0u || lnk_rd16(&p[2]) != _algo.len) {
                _algo_fail(AlgoAbort::END_FAILED, _algo.pages, out_complete);
                return false;
            }
            _algo.phase = 4u;
            _algo.last_info_ms = now_ms - 100u;
        } else if (st == TxnState::FAILED || st == TxnState::FREE) {
            _algo_fail(AlgoAbort::END_FAILED, _algo.pages, out_complete);
            return false;
        }
        return true;
    }

    // phase 4: 等 commit。★终态判据 = 内容对账, 不是 valid+len★
    // "valid && len==expected" 分不出"新算法装上了"与"旧算法还在、长度恰好相同"(同一份源改一个
    // 常量再编译, 长度几乎必然不变) —— 那正是"上传成功却行为没变"的来源。uploading 还为真说明
    // 从机尚未 commit, 此刻的 valid/len 属于上一份, 一律不采信。
    if (_algo.ctl_tag != LNK_TAG_NONE) {
        const TxnState st = txn_state(_algo.ctl_tag);
        if (st == TxnState::DONE) {
            (void)take(_algo.ctl_tag, p);
            _algo.ctl_tag = LNK_TAG_NONE;
            const bool valid = p[0] != 0u;
            const bool uploading = p[1] != 0u;
            const uint16_t len = lnk_rd16(&p[2]);
            const uint16_t slot_crc = lnk_rd16(&p[4]);
            if (out_valid) *out_valid = valid;
            if (out_len) *out_len = len;
            if (valid && !uploading && len == _algo.len) {
                if (++_algo.confirmed >= 2u) {   // 连续 2 次确认(防单帧巧合)
                    const bool content_ok = slot_crc == _algo.crc16;
                    if (!content_ok) {
                        // 页全发完、END 也受理了, 但槽内内容 CRC 不符 ⇒ 中途有字节写歪。
                        _algo_note_abort(AlgoAbort::CONTENT_CRC, _algo.pages);
                    } else {
                        _algo_abort_reason = (uint8_t)AlgoAbort::NONE;   // 成功一次就清掉现场标记
                    }
                    _algo.clear();
                    if (out_complete) *out_complete = true;
                    if (out_ok) *out_ok = content_ok;
                    // 返回值是"链路应答是否正常", 与"内容是否对上"是两件事: 这里应答一切正常,
                    // 只是内容不符, 故仍返回 true 并靠 out_ok=false 让上层走"下发失败"分支。
                    return true;
                }
            } else {
                _algo.confirmed = 0u;
            }
        } else if (st == TxnState::FAILED || st == TxnState::FREE) {
            _algo.ctl_tag = LNK_TAG_NONE;   // 下轮重发 INFO
        }
        return true;
    }
    if ((uint32_t)(now_ms - _algo.last_info_ms) < 100u) return true;
    _algo.last_info_ms = now_ms;
    const uint8_t tag = submit(LNK_CMD_ALGO_INFO, nullptr);
    if (tag != LNK_TAG_NONE) _algo.ctl_tag = tag;
    return true;
}
